# SetDXFColorToLW

## Description
Set DXF color to lineweight

```pascal
PROCEDURE SetDXFColorToLW(
				dxfClrIndex : INTEGER;
				lineWeight  : INTEGER);
```

```python
def vs.SetDXFColorToLW(dxfClrIndex, lineWeight):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dxfClrIndex|INTEGER|   |
|lineWeight|INTEGER|   |

## Version
Availability: from Vectorworks 2013

## Category
* ImportExport